Here's the Terraform plan:

```
$ cd ops/terraform/env/test/stateless
$ terraform plan -no-color -var 'etl_ami=foo' -var 'fhir_ami=foo' -var 'git_branch_name=foo' -var 'git_commit_id=foo' -var 'ssh_key_name=foo'
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.mct_query_time: Refreshing state... [id=bfd-test/bfd-server/http-requests/latency/mct]
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-patient-patientSearchById: Refreshing state... [id=bfd-test/bfd-server/http-requests/count/patient/patientSearchById]
module.stateless.module.fhir_asg.aws_autoscaling_group.main: Refreshing state...
module.stateless.module.fhir_asg.aws_autoscaling_group.main: Refreshing state...
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-latency-fhir-eob: Refreshing state... [id=bfd-test/bfd-server/http-requests/latency/fhir/eob]
module.stateless.data.aws_security_group.vpn: Refreshing state...
module.stateless.data.aws_sns_topic.cloudwatch_ok: Refreshing state...
module.stateless.module.fhir_lb.data.aws_elb_service_account.main: Refreshing state...
module.stateless.data.aws_vpc.mgmt: Refreshing state...
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-coverage: Refreshing state... [id=bfd-test/bfd-server/http-requests/count/coverage]
module.stateless.data.aws_caller_identity.current: Refreshing state...
module.stateless.module.bfd_pipeline.module.ec2_instance.data.aws_caller_identity.current: Refreshing state...
module.stateless.data.aws_iam_policy.ansible_vault_pw_ro_s3: Refreshing state...
module.stateless.data.aws_security_group.db_replicas: Refreshing state...
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count: Refreshing state... [id=bfd-test/bfd-server/http-requests/count]
module.stateless.data.aws_security_group.remote: Refreshing state...
module.stateless.module.fhir_lb.data.aws_caller_identity.current: Refreshing state...
module.stateless.data.aws_security_group.db_primary: Refreshing state...
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-patient: Refreshing state... [id=bfd-test/bfd-server/http-requests/count/patient]
module.stateless.data.aws_sns_topic.cloudwatch_alarms: Refreshing state...
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-latency-over-6000[0]: Refreshing state... [id=bfd-test/bfd-server/http-requests/latency/over-6000]
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-eob: Refreshing state... [id=bfd-test/bfd-server/http-requests/count/eob]
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-patient-patientSearchByIdentifier: Refreshing state... [id=bfd-test/bfd-server/http-requests/count/patient/patientSearchByIdentifier]
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-latency-fhir-coverage: Refreshing state... [id=bfd-test/bfd-server/http-requests/latency/fhir/coverage]
module.stateless.data.aws_db_instance.replica[0]: Refreshing state...
module.stateless.data.aws_db_instance.replica[1]: Refreshing state...
module.stateless.data.aws_db_instance.replica[2]: Refreshing state...
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-latency-fhir-patient: Refreshing state... [id=bfd-test/bfd-server/http-requests/latency/fhir/patient]
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-metadata: Refreshing state... [id=bfd-test/bfd-server/http-requests/count/metadata]
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-not-2xx: Refreshing state... [id=bfd-test/bfd-server/http-requests/count/not-2xx]
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-latency: Refreshing state... [id=bfd-test/bfd-server/http-requests/latency]
module.stateless.module.cw_metric_filters.aws_cloudwatch_log_metric_filter.http-requests-count-500: Refreshing state... [id=bfd-test/bfd-server/http-requests/count/http-500]
module.stateless.data.aws_route53_zone.local_zone: Refreshing state...
module.stateless.data.aws_security_group.tools: Refreshing state...
module.stateless.data.aws_vpc_peering_connection.peers[1]: Refreshing state...
module.stateless.data.aws_vpc_peering_connection.peers[0]: Refreshing state...
module.stateless.data.aws_vpc.main: Refreshing state...
module.stateless.data.aws_s3_bucket.admin: Refreshing state...
module.stateless.data.aws_s3_bucket.logs: Refreshing state...
module.stateless.module.bfd_pipeline.data.aws_iam_policy.ansible_vault_pw_ro_s3: Refreshing state...
module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.http-500: Refreshing state... [id=bfd-test-http-500]
module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.http-requests-latency-fhir-eob-6s: Refreshing state... [id=bfd-test-http-requests-latency-fhir-eob]
module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.http-requests-latency-fhir-eob-4s: Refreshing state... [id=bfd-test-http-requests-latency-fhir-eob]
module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.mct-query-duration: Refreshing state... [id=bfd-test-mct-query-duration]
module.stateless.module.fhir_lb.data.aws_s3_bucket.logs: Refreshing state...
module.stateless.module.fhir_asg.data.aws_subnet.app_subnets[2]: Refreshing state...
module.stateless.module.bfd_pipeline.data.aws_kms_key.master_key: Refreshing state...
module.stateless.module.fhir_asg.data.aws_subnet.app_subnets[0]: Refreshing state...
module.stateless.module.bfd_pipeline.aws_security_group.app: Refreshing state... [id=sg-0ea67e016d7cfd91e]
module.stateless.module.fhir_asg.data.aws_subnet.app_subnets[1]: Refreshing state...
module.stateless.module.fhir_lb.data.aws_subnet.app_subnets[0]: Refreshing state...
module.stateless.module.fhir_lb.data.aws_subnet.app_subnets[1]: Refreshing state...
module.stateless.module.fhir_lb.data.aws_subnet.app_subnets[2]: Refreshing state...
module.stateless.module.fhir_asg.data.aws_kms_key.master_key: Refreshing state...
module.stateless.module.bfd_pipeline.module.ec2_instance.data.aws_kms_key.master_key: Refreshing state...
module.stateless.module.fhir_lb.aws_security_group.lb: Refreshing state... [id=sg-0d25576255b4d5dad]
module.stateless.module.bfd_pipeline.module.ec2_instance.data.aws_subnet.main: Refreshing state...
module.stateless.module.bfd_pipeline.module.iam_profile_bfd_pipeline.aws_iam_role.instance: Refreshing state... [id=bfd-test-bfd_pipeline-role]
module.stateless.module.fhir_iam.aws_iam_role.instance: Refreshing state... [id=bfd-test-fhir-role]
module.stateless.module.bfd_pipeline.data.aws_s3_bucket.rif: Refreshing state...
module.stateless.module.bfd_pipeline.module.ec2_instance.aws_security_group.base: Refreshing state... [id=sg-01b241e4a5490c632]
module.stateless.module.fhir_asg.aws_security_group.base: Refreshing state... [id=sg-08c2e0d1154beffde]
module.stateless.module.fhir_lb.aws_s3_bucket_policy.logs: Refreshing state... [id=bfd-test-logs-577373831711]
module.stateless.module.bfd_pipeline.aws_security_group_rule.allow_db_primary_access: Refreshing state... [id=sgrule-4136128932]
module.stateless.module.fhir_lb.aws_elb.main: Refreshing state... [id=bfd-test-fhir]
module.stateless.module.bfd_pipeline.module.iam_profile_bfd_pipeline.aws_iam_instance_profile.instance: Refreshing state... [id=bfd-test-bfd_pipeline-profile]
module.stateless.module.bfd_pipeline.aws_iam_role_policy_attachment.bfd_pipeline_iam_ansible_vault_pw_ro_s3: Refreshing state... [id=bfd-test-bfd_pipeline-role-20191006005219274200000002]
module.stateless.module.fhir_iam.aws_iam_instance_profile.instance: Refreshing state... [id=bfd-test-fhir-profile]
module.stateless.aws_iam_role_policy_attachment.fhir_iam_ansible_vault_pw_ro_s3: Refreshing state... [id=bfd-test-fhir-role-20190912202743006800000001]
module.stateless.module.bfd_pipeline.module.ec2_instance.aws_instance.main: Refreshing state... [id=i-02db7e2a75533bbdb]
module.stateless.module.bfd_pipeline.aws_iam_policy.bfd_pipeline_rif: Refreshing state... [id=arn:aws:iam::577373831711:policy/bfd-test-pipeline-rw-s3-rif]
module.stateless.module.lb_alarms.aws_cloudwatch_metric_alarm.healthy_hosts[0]: Refreshing state... [id=bfd-test-fhir-healthy-hosts]
module.stateless.module.fhir_asg.aws_security_group.app[0]: Refreshing state... [id=sg-0cdc89644d5f3499d]
module.stateless.module.bfd_pipeline.aws_iam_role_policy_attachment.bfd_pipeline_rif: Refreshing state... [id=bfd-test-bfd_pipeline-role-20191006005219288900000003]
module.stateless.module.fhir_asg.aws_security_group_rule.allow_db_access[0]: Refreshing state... [id=sgrule-1964607417]
module.stateless.module.fhir_asg.aws_launch_template.main: Refreshing state... [id=lt-08cf8a855a25fdbf7]
module.stateless.module.fhir_asg.aws_autoscaling_group.main: Refreshing state... [id=bfd-test-fhir-105]
module.stateless.module.fhir_asg.aws_autoscaling_policy.high-cpu: Refreshing state... [id=bfd-test-fhir-high-cpu-scaleup]
module.stateless.module.fhir_asg.aws_autoscaling_policy.low-cpu: Refreshing state... [id=bfd-test-fhir-low-cpu-scaledown]
module.stateless.module.fhir_asg.aws_cloudwatch_metric_alarm.high-cpu: Refreshing state... [id=bfd-test-fhir-high-cpu]
module.stateless.module.fhir_asg.aws_cloudwatch_metric_alarm.low-cpu: Refreshing state... [id=bfd-test-fhir-low-cpu]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.stateless.module.cw_metric_alarms.aws_cloudwatch_metric_alarm.http-requests-latency-fhir-eob-4s will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "http-requests-latency-fhir-eob-4s" {
        actions_enabled           = true
        alarm_actions             = [
            "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-alarms",
        ]
      ~ alarm_description         = "HTTP EOB Request Latency p99 exceeds 6000.0 seconds in APP-ENV: bfd-test over 3600 seconds" -> "HTTP EOB Request Latency p90 exceeds 4000.0 seconds in APP-ENV: bfd-test over 900 seconds"
        alarm_name                = "bfd-test-http-requests-latency-fhir-eob"
        arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-test-http-requests-latency-fhir-eob"
        comparison_operator       = "GreaterThanThreshold"
        datapoints_to_alarm       = 1
        dimensions                = {}
        evaluation_periods        = 1
      ~ extended_statistic        = "p99" -> "p90"
        id                        = "bfd-test-http-requests-latency-fhir-eob"
        insufficient_data_actions = []
        metric_name               = "http-requests/latency/fhir/eob"
        namespace                 = "bfd-test/bfd-server"
        ok_actions                = [
            "arn:aws:sns:us-east-1:577373831711:bfd-test-cloudwatch-ok",
        ]
      ~ period                    = 3600 -> 900
        tags                      = {}
      ~ threshold                 = 6000 -> 4000
        treat_missing_data        = "notBreaching"
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_group.main must be replaced
+/- resource "aws_autoscaling_group" "main" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:autoScalingGroup:9e225a13-b897-4b8a-8a58-1135e2b9d9cb:autoScalingGroupName/bfd-test-fhir-105" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
        desired_capacity          = 3
        enabled_metrics           = [
            "GroupDesiredCapacity",
            "GroupInServiceInstances",
            "GroupMaxSize",
            "GroupMinSize",
            "GroupPendingInstances",
            "GroupStandbyInstances",
            "GroupTerminatingInstances",
            "GroupTotalInstances",
        ]
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "ELB"
      ~ id                        = "bfd-test-fhir-105" -> (known after apply)
        load_balancers            = [
            "bfd-test-fhir",
        ]
        max_size                  = 6
        metrics_granularity       = "1Minute"
        min_elb_capacity          = 3
        min_size                  = 3
      ~ name                      = "bfd-test-fhir-105" -> (known after apply) # forces replacement
        protect_from_scale_in     = false
      ~ service_linked_role_arn   = "arn:aws:iam::577373831711:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      ~ target_group_arns         = [] -> (known after apply)
      - termination_policies      = [] -> null
        vpc_zone_identifier       = [
            "subnet-0334c1f4eec7a52af",
            "subnet-059284636c71808eb",
            "subnet-0a6ee82462453afbb",
        ]
        wait_for_capacity_timeout = "10m"
        wait_for_elb_capacity     = 3

      ~ launch_template {
          ~ id      = "lt-08cf8a855a25fdbf7" -> (known after apply)
            name    = "bfd-test-fhir"
          ~ version = "105" -> (known after apply)
        }

        tag {
            key                 = "Environment"
            propagate_at_launch = true
            value               = "test"
        }
        tag {
            key                 = "Layer"
            propagate_at_launch = true
            value               = "app"
        }
        tag {
            key                 = "Name"
            propagate_at_launch = true
            value               = "bfd-test-fhir"
        }
        tag {
            key                 = "application"
            propagate_at_launch = true
            value               = "bfd"
        }
        tag {
            key                 = "business"
            propagate_at_launch = true
            value               = "oeda"
        }
        tag {
            key                 = "role"
            propagate_at_launch = true
            value               = "fhir"
        }
        tag {
            key                 = "stack"
            propagate_at_launch = true
            value               = "test"
        }
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_policy.high-cpu must be replaced
-/+ resource "aws_autoscaling_policy" "high-cpu" {
        adjustment_type           = "ChangeInCapacity"
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:74d6b599-841d-42b6-bec6-79db54c83833:autoScalingGroupName/bfd-test-fhir-105:policyName/bfd-test-fhir-high-cpu-scaleup" -> (known after apply)
      ~ autoscaling_group_name    = "bfd-test-fhir-105" -> (known after apply) # forces replacement
        cooldown                  = 300
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "bfd-test-fhir-high-cpu-scaleup" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
        name                      = "bfd-test-fhir-high-cpu-scaleup"
        policy_type               = "SimpleScaling"
        scaling_adjustment        = 2
    }

  # module.stateless.module.fhir_asg.aws_autoscaling_policy.low-cpu must be replaced
-/+ resource "aws_autoscaling_policy" "low-cpu" {
        adjustment_type           = "ChangeInCapacity"
      ~ arn                       = "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:2f078806-34d0-4ef5-a994-a26353dbdcfd:autoScalingGroupName/bfd-test-fhir-105:policyName/bfd-test-fhir-low-cpu-scaledown" -> (known after apply)
      ~ autoscaling_group_name    = "bfd-test-fhir-105" -> (known after apply) # forces replacement
        cooldown                  = 300
      - estimated_instance_warmup = 0 -> null
      ~ id                        = "bfd-test-fhir-low-cpu-scaledown" -> (known after apply)
      + metric_aggregation_type   = (known after apply)
        name                      = "bfd-test-fhir-low-cpu-scaledown"
        policy_type               = "SimpleScaling"
        scaling_adjustment        = -1
    }

  # module.stateless.module.fhir_asg.aws_cloudwatch_metric_alarm.high-cpu will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "high-cpu" {
        actions_enabled           = true
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:74d6b599-841d-42b6-bec6-79db54c83833:autoScalingGroupName/bfd-test-fhir-105:policyName/bfd-test-fhir-high-cpu-scaleup",
        ] -> (known after apply)
      ~ alarm_description         = "CPU usage for bfd-test-fhir-105 ASG" -> (known after apply)
        alarm_name                = "bfd-test-fhir-high-cpu"
        arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-test-fhir-high-cpu"
        comparison_operator       = "GreaterThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "AutoScalingGroupName" = "bfd-test-fhir-105"
        } -> (known after apply)
        evaluation_periods        = 2
        id                        = "bfd-test-fhir-high-cpu"
        insufficient_data_actions = []
        metric_name               = "CPUUtilization"
        namespace                 = "AWS/EC2"
        ok_actions                = []
        period                    = 120
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 60
        treat_missing_data        = "missing"
    }

  # module.stateless.module.fhir_asg.aws_cloudwatch_metric_alarm.low-cpu will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "low-cpu" {
        actions_enabled           = true
      ~ alarm_actions             = [
          - "arn:aws:autoscaling:us-east-1:577373831711:scalingPolicy:2f078806-34d0-4ef5-a994-a26353dbdcfd:autoScalingGroupName/bfd-test-fhir-105:policyName/bfd-test-fhir-low-cpu-scaledown",
        ] -> (known after apply)
      ~ alarm_description         = "CPU usage for bfd-test-fhir-105 ASG" -> (known after apply)
        alarm_name                = "bfd-test-fhir-low-cpu"
        arn                       = "arn:aws:cloudwatch:us-east-1:577373831711:alarm:bfd-test-fhir-low-cpu"
        comparison_operator       = "LessThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "AutoScalingGroupName" = "bfd-test-fhir-105"
        } -> (known after apply)
        evaluation_periods        = 2
        id                        = "bfd-test-fhir-low-cpu"
        insufficient_data_actions = []
        metric_name               = "CPUUtilization"
        namespace                 = "AWS/EC2"
        ok_actions                = []
        period                    = 120
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 20
        treat_missing_data        = "missing"
    }

  # module.stateless.module.fhir_asg.aws_launch_template.main will be updated in-place
  ~ resource "aws_launch_template" "main" {
        arn                     = "arn:aws:ec2:us-east-1:577373831711:launch-template/lt-08cf8a855a25fdbf7"
        default_version         = 1
        description             = "Template for the test environment fhir servers"
        disable_api_termination = false
        ebs_optimized           = "true"
        id                      = "lt-08cf8a855a25fdbf7"
      ~ image_id                = "ami-0813fa9bb44c4fa11" -> "foo"
        instance_type           = "m5.2xlarge"
      ~ key_name                = "bfd-test" -> "foo"
      ~ latest_version          = 105 -> (known after apply)
        name                    = "bfd-test-fhir"
        security_group_names    = []
        tags                    = {}
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1lCgpleGVjID4gPih0ZWUgLWEgL3Zhci9sb2cvdXNlcl9kYXRhLmxvZyAyPiYxKQoKZ2l0IGNsb25lIGh0dHBzOi8vZ2l0aHViLmNvbS9DTVNnb3YvYmVuZWZpY2lhcnktZmhpci1kYXRhLmdpdCAtLWJyYW5jaCBCTFVFQlVUVE9OLTEzNTktZW5hYmxlLXByb2QtZGVwbG95cyAtLXNpbmdsZS1icmFuY2gKCmNkIGJlbmVmaWNpYXJ5LWZoaXItZGF0YS9vcHMvYW5zaWJsZS9wbGF5Ym9va3MtY2NzLwoKZ2l0IGNoZWNrb3V0IEJMVUVCVVRUT04tMTM1OS1lbmFibGUtcHJvZC1kZXBsb3lzCgphd3MgczMgY3AgczM6Ly9iZmQtbWdtdC1hZG1pbi01NzczNzM4MzE3MTEvYW5zaWJsZS92YXVsdC5wYXNzd29yZCAuCgojIFRoZSBleHRyYV92YXJzLmpzb24gZmlsZSBmcm9tIHRoZSBwcmV2aW91cyBidWlsZCBzdGVwIGNvbnRhaW5zIGEgZmV3IGluY29ycmVjdCB2YWx1ZXMKIyBhbmQgbmVlZHMgdG8gZ2V0IHRyaW1tZWQgZG93biB0byB0aGUgZm9sbG93aW5nCmNhdCA8PEVPRiA+PiBleHRyYV92YXJzLmpzb24KewogICAgImVudiI6InRlc3QiLAogICAgImRhdGFfc2VydmVyX3ZlcnNpb24iOiIxLjAuMC1TTkFQU0hPVCIKfQpFT0YKCmFuc2libGUtcGxheWJvb2sgLS1leHRyYS12YXJzICdAZXh0cmFfdmFycy5qc29uJyAtLXZhdWx0LXBhc3N3b3JkLWZpbGU9dmF1bHQucGFzc3dvcmQgLS10YWdzICJwb3N0LWFtaSIgbGF1bmNoX2JmZC1zZXJ2ZXIueW1sCgpybSB2YXVsdC5wYXNzd29yZAo=" -> "IyEvYmluL2Jhc2gKc2V0IC1lCgpleGVjID4gPih0ZWUgLWEgL3Zhci9sb2cvdXNlcl9kYXRhLmxvZyAyPiYxKQoKZ2l0IGNsb25lIGh0dHBzOi8vZ2l0aHViLmNvbS9DTVNnb3YvYmVuZWZpY2lhcnktZmhpci1kYXRhLmdpdCAtLWJyYW5jaCBmb28gLS1zaW5nbGUtYnJhbmNoCgpjZCBiZW5lZmljaWFyeS1maGlyLWRhdGEvb3BzL2Fuc2libGUvcGxheWJvb2tzLWNjcy8KCmdpdCBjaGVja291dCBmb28KCmF3cyBzMyBjcCBzMzovL2JmZC1tZ210LWFkbWluLTU3NzM3MzgzMTcxMS9hbnNpYmxlL3ZhdWx0LnBhc3N3b3JkIC4KCiMgVGhlIGV4dHJhX3ZhcnMuanNvbiBmaWxlIGZyb20gdGhlIHByZXZpb3VzIGJ1aWxkIHN0ZXAgY29udGFpbnMgYSBmZXcgaW5jb3JyZWN0IHZhbHVlcwojIGFuZCBuZWVkcyB0byBnZXQgdHJpbW1lZCBkb3duIHRvIHRoZSBmb2xsb3dpbmcKY2F0IDw8RU9GID4+IGV4dHJhX3ZhcnMuanNvbgp7CiAgICAiZW52IjoidGVzdCIsCiAgICAiZGF0YV9zZXJ2ZXJfdmVyc2lvbiI6IjEuMC4wLVNOQVBTSE9UIgp9CkVPRgoKYW5zaWJsZS1wbGF5Ym9vayAtLWV4dHJhLXZhcnMgJ0BleHRyYV92YXJzLmpzb24nIC0tdmF1bHQtcGFzc3dvcmQtZmlsZT12YXVsdC5wYXNzd29yZCAtLXRhZ3MgInBvc3QtYW1pIiBsYXVuY2hfYmZkLXNlcnZlci55bWwKCnJtIHZhdWx0LnBhc3N3b3JkCg=="
        vpc_security_group_ids  = [
            "sg-08c2e0d1154beffde",
            "sg-0cdc89644d5f3499d",
        ]

        block_device_mappings {
            device_name = "/dev/sda1"

            ebs {
                delete_on_termination = "true"
                encrypted             = "true"
                iops                  = 0
                kms_key_id            = "arn:aws:kms:us-east-1:577373831711:key/7dcca42a-da93-40b1-a4a8-2eb10050f449"
                volume_size           = 100
                volume_type           = "gp2"
            }
        }

        iam_instance_profile {
            name = "bfd-test-fhir-profile"
        }

        monitoring {
            enabled = true
        }

        placement {
            tenancy = "default"
        }

        tag_specifications {
            resource_type = "instance"
            tags          = {
                "Environment" = "test"
                "Layer"       = "app"
                "Name"        = "bfd-test-fhir"
                "application" = "bfd"
                "business"    = "oeda"
                "role"        = "fhir"
                "stack"       = "test"
            }
        }
        tag_specifications {
            resource_type = "volume"
            tags          = {
                "Environment" = "test"
                "Layer"       = "app"
                "Name"        = "bfd-test-fhir"
                "application" = "bfd"
                "business"    = "oeda"
                "role"        = "fhir"
                "snapshot"    = "true"
                "stack"       = "test"
            }
        }
    }

  # module.stateless.module.fhir_iam.aws_iam_role_policy.logs_policy will be created
  + resource "aws_iam_role_policy" "logs_policy" {
      + id     = (known after apply)
      + name   = "bfd-test-fhir-logs-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "bfd-test-fhir-role"
    }

  # module.stateless.module.bfd_pipeline.module.ec2_instance.aws_instance.main must be replaced
-/+ resource "aws_instance" "main" {
      ~ ami                          = "ami-0484fefbd46af1118" -> "foo" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:577373831711:instance/i-02db7e2a75533bbdb" -> (known after apply)
        associate_public_ip_address  = false
        availability_zone            = "us-east-1b"
      ~ cpu_core_count               = 4 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
        ebs_optimized                = true
        get_password_data            = false
      + host_id                      = (known after apply)
        iam_instance_profile         = "bfd-test-bfd_pipeline-profile"
      ~ id                           = "i-02db7e2a75533bbdb" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "m5.2xlarge"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      ~ key_name                     = "bfd-test" -> "foo" # forces replacement
        monitoring                   = true
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07089cd3114b2438e" -> (known after apply)
      ~ private_dns                  = "ip-10-235-21-103.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.235.21.103" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = true
        subnet_id                    = "subnet-048c7b59678709fa4"
        tags                         = {
            "Environment" = "test"
            "Layer"       = "data"
            "Name"        = "bfd-test-etl"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "etl"
            "stack"       = "test"
        }
        tenancy                      = "default"
      ~ user_data                    = "9af2fbd003b8da3d08fe368219652a83cdaeca04" -> "f9e78ef0c19b65c0be442c6aa5c4e8bab9e9031d" # forces replacement
        volume_tags                  = {
            "Environment" = "test"
            "Layer"       = "data"
            "Name"        = "bfd-test-etl"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "etl"
            "snapshot"    = "true"
            "stack"       = "test"
        }
        vpc_security_group_ids       = [
            "sg-01b241e4a5490c632",
            "sg-0a1a9d02fe5ac3891",
            "sg-0ea67e016d7cfd91e",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
            delete_on_termination = true
            encrypted             = true
          ~ iops                  = 300 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:577373831711:key/7dcca42a-da93-40b1-a4a8-2eb10050f449" -> "alias/bfd-test-cmk" # forces replacement
          ~ volume_id             = "vol-0f3ffe2f08e762352" -> (known after apply)
            volume_size           = 100
            volume_type           = "gp2"
        }
    }

  # module.stateless.module.bfd_pipeline.module.iam_profile_bfd_pipeline.aws_iam_role_policy.logs_policy will be created
  + resource "aws_iam_role_policy" "logs_policy" {
      + id     = (known after apply)
      + name   = "bfd-test-bfd_pipeline-logs-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "bfd-test-bfd_pipeline-role"
    }

Plan: 6 to add, 4 to change, 4 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```